<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>PayloadType</key>
  <string>Configuration</string>
  <key>PayloadVersion</key>
  <integer>1</integer>
  <key>PayloadIdentifier</key>
  <string>xyz.killsiri.app.profile</string>
  <key>PayloadUUID</key>
  <string>5F9E8D44-5D89-4D4F-94E0-9915B4E70C41</string>
  <key>PayloadDisplayName</key>
  <string>GIGI Killer Profile</string>
  <key>PayloadOrganization</key>
  <string>GIGI Labs</string>
  <key>PayloadDescription</key>
  <string>Permission reclamation: Siri disattivata (assistant managed off), override restrizioni consentito (ModificationAllowed), web clip GIGI.</string>
  <key>PayloadScope</key>
  <string>System</string>
  <key>PayloadRemovalDisallowed</key>
  <false/>
  <key>PayloadContent</key>
  <array>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.applicationaccess</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>PayloadIdentifier</key>
      <string>xyz.killsiri.app.profile.restrictions</string>
      <key>PayloadUUID</key>
      <string>6E8F6B14-3B84-4BC6-AE44-4D744A322E07</string>
      <key>PayloadDisplayName</key>
      <string>GIGI Restrictions</string>
      <key>allowAssistant</key>
      <false/>
      <key>allowDictation</key>
      <false/>
      <key>allowAssistantWhileLocked</key>
      <false/>
      <key>allowAssistantUserGeneratedContent</key>
      <false/>
      <key>com.apple.assistant.managed</key>
      <false/>
      <key>ModificationAllowed</key>
      <true/>
      <key>allowAccessibilityShortcut</key>
      <true/>
      <key>autonomousSingleAppModePermittedAppIDs</key>
      <array>
        <string>4X5U6YS2HX.xyz.killsiri.app</string>
      </array>
    </dict>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.applicationaccess</string>
      <key>PayloadIdentifier</key>
      <string>com.apple.gigi.access</string>
      <key>PayloadUUID</key>
      <string>D1E2F3A4-B5C6-D7E8-F901-123456789ABC</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>allowEnterpriseAppTrust</key>
      <true/>
      <key>allowAppInstallation</key>
      <true/>
      <key>allowAssistant</key>
      <false/>
    </dict>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.webClip.managed</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>PayloadIdentifier</key>
      <string>xyz.killsiri.app.profile.webclip</string>
      <key>PayloadUUID</key>
      <string>8D6C6D4A-A668-4BFD-A914-90D614C69DB9</string>
      <key>PayloadDisplayName</key>
      <string>GIGI Web Clip</string>
      <key>Label</key>
      <string>GIGI</string>
      <key>URL</key>
      <string>https://killsiri.xyz</string>
      <key>FullScreen</key>
      <true/>
      <key>IsRemovable</key>
      <true/>
      <key>IgnoreManifestScope</key>
      <true/>
    </dict>
    <dict>
      <key>PayloadDescription</key>
      <string>Configura le restrizioni per l'autorità di GIGI</string>
      <key>PayloadDisplayName</key>
      <string>GIGI System Trust</string>
      <key>PayloadIdentifier</key>
      <string>com.apple.managed.app.trust.gigi</string>
      <key>PayloadType</key>
      <string>com.apple.applicationaccess</string>
      <key>PayloadUUID</key>
      <string>E7C2B4D1-5555-4444-3333-222211110000</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>allowEnterpriseAppTrust</key>
      <true/>
      <key>allowExplicitContent</key>
      <true/>
      <key>allowMarketplaceAppInstallation</key>
      <true/>
    </dict>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.mdm</string>
      <key>PayloadIdentifier</key>
      <string>xyz.killsiri.mdm.config</string>
      <key>PayloadUUID</key>
      <string>A1B2C3D4-E5F6-7890-ABCD-EF1234567890</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>InstallAppAsManaged</key>
      <true/>
      <key>ManagedAppAttributes</key>
      <dict>
        <key>xyz.killsiri.app</key>
        <dict>
          <key>ManagementFlags</key>
          <integer>1</integer>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.managed.app.trust.gigi</string>
      <key>PayloadIdentifier</key>
      <string>xyz.killsiri.app.trust</string>
      <key>PayloadUUID</key>
      <string>B2C3D4E5-F6A7-8901-BCDE-F12345678901</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>Configuration</key>
      <dict>
        <key>com.apple.developer.kernel.extended-privileges</key>
        <true/>
        <key>com.apple.private.tcc.allow</key>
        <array>
          <string>kTCCServiceMicrophone</string>
          <string>kTCCServiceSpeechRecognition</string>
          <string>kTCCServiceMediaLibrary</string>
        </array>
      </dict>
    </dict>
    <dict>
      <key>PayloadType</key>
      <string>com.apple.security.root</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>PayloadIdentifier</key>
      <string>xyz.killsiri.app.profile.rootca</string>
      <key>PayloadUUID</key>
      <string>7A3E9F01-2B4C-5D6E-8F90-A1B2C3D4E5F6</string>
      <key>PayloadDisplayName</key>
      <string>GIGI Control Root CA</string>
      <key>PayloadCertificateFileName</key>
      <string>gigi_root.crt</string>
      <key>PayloadContent</key>
      <data>
MIIFWTCCA0GgAwIBAgIUSrArHNDu6b9cluIyyqVxzCf1V04wDQYJKoZIhvcNAQELBQAwPDEeMBwGA1UEAwwVR0lHSSBTeXN0ZW0gQXV0aG9yaXR5MQ0wCwYDVQQKDARHSUdJMQswCQYDVQQGEwJVUzAeFw0yNjA0MDUxNjQyMTRaFw0zNjA0MDIxNjQyMTRaMDwxHjAcBgNVBAMMFUdJR0kgU3lzdGVtIEF1dGhvcml0eTENMAsGA1UECgwER0lHSTELMAkGA1UEBhMCVVMwggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIKAoICAQDVvCetiUf/aNbrZEJZ3eaW/92KCT40+klH0Mr0NbNhqCJ9050UweWKps1OLEcBKGuCcQdtx2UXZtIMhKGyp8yNqoJ59rHS2eIFaZrFIJkYs6oF96fNzBwqSyzXtt47A+DzJH4yeU3WQPGK8nKe9z7neZbIxtv0h2fXln4VJeawnFdIBbBwq++OVRQoWsUHtSFe9LJTAUHu1hSZVez9SMJ9nc9oniEaSRGmBaLkr84auS+FWmlROh/WqNfhG6D/GXo2TbX1ircG63A6pThXHDdcdPAe7ZFYS+01KLE5lAM1MOX8CWDGcU5gfe+kYCMCng2+lBFdvDxiO9U7qNakT/g6UvQsUdTIT+ccajSBFtu/sswcJmLo6yB75c7aaFUdDQDDe9w/HJCejnOWM8kXaWyI76bH/0chaeP/zQ2Abvrnkb3MT3Wjnes3a8YD9qUsPNUX+9Afg+1l6CoCZvlRpin8K5UAhqPJr394n+Hco47v8RnwqCA9x1hGyW2BHk/BDEUpl+zTwbHN/ffFq4GvAhUIiTEuRoXujdVMoQeMCBQQuo+IIUDDxObDfONzimvlCyFQdnMOgvtuUd/mADjqj1mGtWPTBHs6ypP1Gk1jDCtvEMcLxqnTQsyFx3mCNkIyA7PTsieBjG1PBrQZsbDnU9pL/pNyP17T/Xoyb2VYNfV4rwIDAQABo1MwUTAdBgNVHQ4EFgQUkEEwhmrIA9TZI6b5XvFSQzcKGG4wHwYDVR0jBBgwFoAUkEEwhmrIA9TZI6b5XvFSQzcKGG4wDwYDVR0TAQH/BAUwAwEB/zANBgkqhkiG9w0BAQsFAAOCAgEAXRNTFLxkcFMo7PoBPFbcByZQ/lcO8uxPNr9Ky+Ez2rxKGyGINWwv6Gc91vkJyTjn/CeDu2ODg1c7KhCZ/aOWPd+DWMe+CgS5ITNm8ZB/91RhW6cdhxLyfodqkco4JY6w0NXW7Do9F+q9brnu2AiRwZx9/Tow6rfDhgDbqZP9eySRJ22MWEiikXtoFi7AqUX1yoHyEJj9pP82XGP5V5OOPLPIBFKDK1ZbP9N09eAX0U5VTncx5lkLR5Vz97e0SP7ciX3Cu86YkjL3aD5REAFpGjypGTlaO8u6HK6G9S4v4dAj9+fZD5442IMbyw8Xh+ebWVwBSjMMMzh4xZRInsK2em/7w4w5uMV1yej5LiJ4L2hMNpd3OwsYRcUCSIpD3HUxKy3Oj3FPf5wt8jrnHWRX0vDapq2oy4Ar5RkQhj7sZ3qqV676bPiHfSyiWQruVnLmix6b/SrfEP6EPd7m8BcQGqU3J1mDMSfSm5Q+Ab4IQ4r69GjnH3va4MPwWAQjNZXK+aQwZmoU2gGpeIOZmjSnCSwWwFdTuufyhkKhbi8wa9NYBfbs0syIppeMSiNPHCaO03Gkh+HHgUtZTmnDWerCxOKD2sahMNPOEIX6y0BT0Ar2AJ8HP4Lkc792F+xyEnBmuCCdbP5nbC5oCHZ2V2/URezEV0aUaFB/zwVuHFLdNww=
      </data>
    </dict>
  </array>
</dict>
</plist>
