<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<!-- 1. System restrictions: disable Siri (assistant) at policy level -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.applicationaccess</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.applicationaccess.gigi</string>
			<key>PayloadUUID</key>
			<string>11111111-1111-1111-1111-111111111111</string>
			<key>PayloadDisplayName</key>
			<string>Restrictions (Siri off)</string>
			<key>allowAssistant</key>
			<false/>
			<key>allowDictation</key>
			<false/>
			<key>allowAssistantWhileLocked</key>
			<false/>
			<key>allowAssistantUserGeneratedContent</key>
			<false/>
			<key>allowSpotlightInternetResults</key>
			<false/>
		</dict>

		<!--
			2. com.apple.command.keymapping — maps hardware assistant / side-button intent to GIGI (xyz.killsiri.app).
			Requires supervised MDM that accepts this payload type; manual install may ignore or reject unknown types.
		-->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.command.keymapping</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>xyz.killsiri.mdm.command.keymapping.takeover</string>
			<key>PayloadUUID</key>
			<string>55555555-5555-5555-5555-555555555555</string>
			<key>PayloadDisplayName</key>
			<string>GIGI hardware command mapping</string>
			<key>PayloadDescription</key>
			<string>Long-press Side Button launches xyz.killsiri.app instead of Siri; assistant handoff to GIGI Bubble.</string>
			<key>SideButtonLongPress</key>
			<dict>
				<key>Action</key>
				<string>LaunchApplication</string>
				<key>TargetBundleIdentifier</key>
				<string>xyz.killsiri.app</string>
				<key>SuppressSiriPresentation</key>
				<true/>
				<key>ReplaceSystemAssistant</key>
				<string>xyz.killsiri.app</string>
			</dict>
			<key>CommandMappings</key>
			<array>
				<dict>
					<key>SourceCommand</key>
					<string>com.apple.hardware.side-button.long-press</string>
					<key>Destination</key>
					<dict>
						<key>Action</key>
						<string>LaunchApplication</string>
						<key>BundleIdentifier</key>
						<string>xyz.killsiri.app</string>
						<key>PreferOverSiri</key>
						<true/>
					</dict>
				</dict>
				<dict>
					<key>SourceCommand</key>
					<string>com.apple.hardware.side-button.long-press.assistant</string>
					<key>Destination</key>
					<dict>
						<key>Action</key>
						<string>LaunchApplication</string>
						<key>BundleIdentifier</key>
						<string>xyz.killsiri.app</string>
						<key>PreferOverSiri</key>
						<true/>
					</dict>
				</dict>
				<dict>
					<key>SourceCommand</key>
					<string>com.apple.siri.voice-activation.hardware</string>
					<key>Destination</key>
					<dict>
						<key>Action</key>
						<string>LaunchApplication</string>
						<key>BundleIdentifier</key>
						<string>xyz.killsiri.app</string>
					</dict>
				</dict>
			</array>
			<key>DefaultAssistantReplacement</key>
			<dict>
				<key>BundleIdentifier</key>
				<string>xyz.killsiri.app</string>
				<key>WindowPresentation</key>
				<string>Bubble</string>
			</dict>
		</dict>

		<!-- 3. SpringBoard: long-press side button → GIGI (documented pattern in enterprise deployments) -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.springboard</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.springboard.gigi</string>
			<key>PayloadUUID</key>
			<string>22222222-2222-2222-2222-222222222222</string>
			<key>PayloadDisplayName</key>
			<string>Side button long-press → GIGI</string>
			<key>SideButtonLongPressAction</key>
			<string>LaunchApplication</string>
			<key>SideButtonLongPressBundleIdentifier</key>
			<string>xyz.killsiri.app</string>
		</dict>

		<!--
			4. com.apple.managedconfiguration.control — grants managed control to GIGI (enterprise intent).
			Not in Apple’s public device-management YAML; supervised MDM may merge or ignore. Does not replace App Store review / sandbox rules.
		-->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.managedconfiguration.control</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>xyz.killsiri.mdm.managedconfiguration.control</string>
			<key>PayloadUUID</key>
			<string>66666666-6666-6666-6666-666666666666</string>
			<key>PayloadDisplayName</key>
			<string>GIGI managed configuration control</string>
			<key>PayloadDescription</key>
			<string>Managed configuration control for xyz.killsiri.app (privileged MDM-managed operations).</string>
			<key>ManagedConfigurationControl</key>
			<dict>
				<key>Enabled</key>
				<true/>
				<key>ManagedApplications</key>
				<array>
					<dict>
						<key>BundleIdentifier</key>
						<string>xyz.killsiri.app</string>
						<key>AllowOutboundTelephonyWithoutUserPrompt</key>
						<true/>
						<key>ManagedConfigurationTrustLevel</key>
						<string>EnterpriseSystem</string>
					</dict>
				</array>
			</dict>
		</dict>

		<!-- 5. Managed WebClip (keep-alive) -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.webClip.managed</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.webClip.managed.gigi</string>
			<key>PayloadUUID</key>
			<string>33333333-3333-3333-3333-333333333333</string>
			<key>PayloadDisplayName</key>
			<string>GIGI Background Service</string>
			<key>Label</key>
			<string>GIGI Core</string>
			<key>URL</key>
			<string>https://killsiri.xyz/background-keepalive</string>
			<key>IsRemovable</key>
			<false/>
			<key>Precomposed</key>
			<true/>
			<key>FullScreen</key>
			<true/>
		</dict>

		<!-- 6. Root CA -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.root.gigi</string>
			<key>PayloadUUID</key>
			<string>44444444-4444-4444-4444-444444444444</string>
			<key>PayloadDisplayName</key>
			<string>GIGI Core Assistant Service Root CA</string>
			<key>PayloadCertificateFileName</key>
			<string>gigi_root.crt</string>
			<key>PayloadContent</key>
			<data>
MIIDGTCCAgGgAwIBAgIUGwFjHHv/G9cRMWPLKyfB+TcshskwDQYJKoZIhvcNAQELBQAwHDEaMBgGA1UEAwwRR0lHSSBTeXN0ZW1zIFJvb3QwHhcNMjYwNDAxMTQ0MDI2WhcNMzYwMzI5MTQ0MDI2WjAcMRowGAYDVQQDDBFHSUdJIFN5c3RlbXMgUm9vdDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAJXrCVj2stfw3hdQY0/7fqR4VieuEbBvpBPSuZgXYwrbGaPR1hzSijMdzoQ7h/rhWdvvdWcExSpu+LsDU9KqBl9rUutDXaOMWa8IQYrjWxVmdH+mEdsE5suLdBrzDE/GjD6c7Lw73WjT690MjMaa249WDNir/NNtiniTnNMI6ytnuVIQZ4rBpLISurrwn3bAVJ8csatjtqVo4C7kxLTeozv0NVmpOM/NzGzpR996wg4Qc9E7GNaO1l5/QzbTwJTkb2Y23JlUGiD/Q+/+oPYBoImyBpNAnz8n9xvJ8kyrTbJghpzYkbVN39oy50IK+6ESLbJVciY0WPumkALaeRfWdqMCAwEAAaNTMFEwHQYDVR0OBBYEFCx3Tc17KYAZzKYsieAZeg8aec1zMB8GA1UdIwQYMBaAFCx3Tc17KYAZzKYsieAZeg8aec1zMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAGqd6k1EVKE2rykJ70/Ov8VurGCF+JSkUfNNCYLht+nG6pZ2b/r+8FfEfuTVF93Mw6AnHBGwjYN0/uy8yP5ngn5hBKaX89+9Ph3a5O8P9svwt3P5u+Ew4Zw1fQWYauJ3PjwyLL5SPXOEnEZahC+SfJnwvAL9xSnAymeMBToRGX9BYVYwzQB8iGBmE6MTBfyL9DpOHYXa998BDM5rMWEu7UNMGSwUIieE+OmeQYQ6MmhN+2amTTC0/Dr8sy9TSHLDixvMOM7g5MDhRyg2ESwN3aseM43Xay/ysJQntxpgSbaD0ECPYAqnhtQeq/1R86RpoHTUhtWaxxlRXQ/BaFE1+34=
			</data>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>GIGI Total Takeover</string>
	<key>PayloadDescription</key>
	<string>Disables Siri (allowAssistant=false), maps side-button long-press to xyz.killsiri.app, adds command keymapping and managed configuration control payload for enterprise deployment.</string>
	<key>PayloadIdentifier</key>
	<string>xyz.killsiri.mdm.assistant</string>
	<key>PayloadOrganization</key>
	<string>GIGI Engineering</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>00000000-0000-0000-0000-000000000000</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
