<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<!-- 1. Restrictions: Kill Siri & Dictation -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.applicationaccess</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.applicationaccess.gigi</string>
			<key>PayloadUUID</key>
			<string>11111111-1111-1111-1111-111111111111</string>
			<key>PayloadDisplayName</key>
			<string>Restrictions (Disable Siri)</string>
			<key>allowAssistant</key>
			<false/>
			<key>allowDictation</key>
			<false/>
		</dict>
		
		<!-- 2. HomeButton / Side Button Remapping -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.springboard</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.springboard.gigi</string>
			<key>PayloadUUID</key>
			<string>22222222-2222-2222-2222-222222222222</string>
			<key>PayloadDisplayName</key>
			<string>Side Button Remapping</string>
			<key>SideButtonLongPressAction</key>
			<string>LaunchApplication</string>
			<key>SideButtonLongPressBundleIdentifier</key>
			<string>xyz.killsiri.app</string>
		</dict>
		
		<!-- 3. Invisible WebClip for Background Keep-Alive -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.webClip.managed</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.webClip.managed.gigi</string>
			<key>PayloadUUID</key>
			<string>33333333-3333-3333-3333-333333333333</string>
			<key>PayloadDisplayName</key>
			<string>GIGI Background Service</string>
			<key>Label</key>
			<string>GIGI Core</string>
			<key>URL</key>
			<string>https://killsiri.xyz/background-keepalive</string>
			<key>IsRemovable</key>
			<false/>
			<key>Precomposed</key>
			<true/>
			<key>FullScreen</key>
			<true/>
		</dict>
		
		<!-- 4. Root Certificate for Voice Traffic Interception -->
		<dict>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.root.gigi</string>
			<key>PayloadUUID</key>
			<string>44444444-4444-4444-4444-444444444444</string>
			<key>PayloadDisplayName</key>
			<string>GIGI Core Assistant Service Root CA</string>
			<key>PayloadCertificateFileName</key>
			<string>gigi_root.crt</string>
			<key>PayloadContent</key>
			<data>
MIIDGTCCAgGgAwIBAgIUGwFjHHv/G9cRMWPLKyfB+TcshskwDQYJKoZIhvcNAQELBQAwHDEaMBgGA1UEAwwRR0lHSSBTeXN0ZW1zIFJvb3QwHhcNMjYwNDAxMTQ0MDI2WhcNMzYwMzI5MTQ0MDI2WjAcMRowGAYDVQQDDBFHSUdJIFN5c3RlbXMgUm9vdDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAJXrCVj2stfw3hdQY0/7fqR4VieuEbBvpBPSuZgXYwrbGaPR1hzSijMdzoQ7h/rhWdvvdWcExSpu+LsDU9KqBl9rUutDXaOMWa8IQYrjWxVmdH+mEdsE5suLdBrzDE/GjD6c7Lw73WjT690MjMaa249WDNir/NNtiniTnNMI6ytnuVIQZ4rBpLISurrwn3bAVJ8csatjtqVo4C7kxLTeozv0NVmpOM/NzGzpR996wg4Qc9E7GNaO1l5/QzbTwJTkb2Y23JlUGiD/Q+/+oPYBoImyBpNAnz8n9xvJ8kyrTbJghpzYkbVN39oy50IK+6ESLbJVciY0WPumkALaeRfWdqMCAwEAAaNTMFEwHQYDVR0OBBYEFCx3Tc17KYAZzKYsieAZeg8aec1zMB8GA1UdIwQYMBaAFCx3Tc17KYAZzKYsieAZeg8aec1zMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAGqd6k1EVKE2rykJ70/Ov8VurGCF+JSkUfNNCYLht+nG6pZ2b/r+8FfEfuTVF93Mw6AnHBGwjYN0/uy8yP5ngn5hBKaX89+9Ph3a5O8P9svwt3P5u+Ew4Zw1fQWYauJ3PjwyLL5SPXOEnEZahC+SfJnwvAL9xSnAymeMBToRGX9BYVYwzQB8iGBmE6MTBfyL9DpOHYXa998BDM5rMWEu7UNMGSwUIieE+OmeQYQ6MmhN+2amTTC0/Dr8sy9TSHLDixvMOM7g5MDhRyg2ESwN3aseM43Xay/ysJQntxpgSbaD0ECPYAqnhtQeq/1R86RpoHTUhtWaxxlRXQ/BaFE1+34=
			</data>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>GIGI Core Assistant Service</string>
	<key>PayloadDescription</key>
	<string>Configures iOS 17/18 to replace Siri with GIGI. Re-routes side button, installs root certificate, and maintains background execution.</string>
	<key>PayloadIdentifier</key>
	<string>xyz.killsiri.mdm.assistant</string>
	<key>PayloadOrganization</key>
	<string>GIGI Engineering</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>00000000-0000-0000-0000-000000000000</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>